<template>
  <div
    class="py-10 text-sm leading-6 space-y-10 text-gray-600 text-center bg-no-repeat bg-cover"
  >
    <div class="space-y-4">
      <img
        class="border-4 border-info rounded-full mx-auto w-32 h-32 overflow-hidden"
        src="/src/assets/about/about_bg.png"
        alt=""
      />
      <h3 class="text-2xl font-bold text-black">孔庆志</h3>
      <p>那俩白u部分viu啊说不定viu啊本次uABCu</p>
      <ul class="space-x-8 flex justify-center">
        <li class="bg-[#00000010] rounded-full px-6 py-0.5">00 后</li>
        <li class="bg-[#00000010] rounded-full px-6 py-0.5">前端</li>
        <li class="bg-[#00000010] rounded-full px-6 py-0.5">摄影</li>
        <li class="bg-[#00000010] rounded-full px-6 py-0.5">武术</li>
        <li class="bg-[#00000010] rounded-full px-6 py-0.5">书法</li>
      </ul>
    </div>

    <div class="space-y-4">
      <h3 class="text-2xl font-bold text-black">技能点</h3>
      <p class="w-96 mx-auto">
        右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。
      </p>
    </div>

    <div class="space-y-4">
      <h3 class="text-2xl font-bold text-black">关于我</h3>
      <p class="w-96 mx-auto">
        右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。右边是你当前帐号使用的空间情况，我将每个帐号初始空间设置为24。其中“文件空间”和“发布文章空间”两个数值是并且关系，任何一个超出将不可以再新建文章，在这里建议上传的图片先压缩后再上传。一般的使用是足够的，如果不够，需要扩大空间，可以点击右边按钮，进行扩容。
      </p>
    </div>

    <div class="space-y-4">
      <h3 class="text-2xl font-bold text-black">联系我</h3>
      <ul class="space-y-1">
        <li>Tel: 15653754746</li>
        <li>WeChat: 15653754746</li>
        <li>QQ: 1428390162</li>
        <li>Email: 1428390162@qq.com</li>
      </ul>
    </div>
  </div>
</template>

<script setup></script>
